vty_transcript_test> list
...
  multi0 (one|two|three)
  multi1 ([one]|[two]|[three])
  multi2 [(one|two|three)]

vty_transcript_test> multi0 ?
  one    1
  two    2
  three  3

vty_transcript_test> multi0 one
ok argc=1 one

vty_transcript_test> multi0 two
ok argc=1 two

vty_transcript_test> multi0 o
ok argc=1 o

vty_transcript_test> multi0 t
% Ambiguous command.

vty_transcript_test> multi0 th
ok argc=1 th

vty_transcript_test> multi0
% Command incomplete.

vty_transcript_test> multi1 ?
  [one]    1
  [two]    2
  [three]  3

vty_transcript_test> multi1 one
ok argc=1 one

vty_transcript_test> multi1 two
ok argc=1 two

vty_transcript_test> multi1 o
ok argc=1 o

vty_transcript_test> multi1 t
% Ambiguous command.

vty_transcript_test> multi1 th
ok argc=1 th

vty_transcript_test> multi1
ok argc=0

vty_transcript_test> multi1 [one]
% Unknown command.

vty_transcript_test> multi2 ?
  [one]    1
  [two]    2
  [three]  3

vty_transcript_test> multi2 one
ok argc=1 one

vty_transcript_test> multi2 two
ok argc=1 two

vty_transcript_test> multi2
ok argc=0

vty_transcript_test> multi0 thr
ok argc=1 thr

vty_transcript_test> multi1 on
ok argc=1 on

vty_transcript_test> multi2 t
% Ambiguous command.
